html/articles/ideas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-24 ma 22:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ideas</title>
<meta name="author" content="Tobin Stultiens" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Ideas</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org05d341d">1. Ideas</a>
<ul>
<li><a href="#org16551e3">1.1. zha jiang min&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Chinese">Chinese</span>&#xa0;<span class="Noodles">Noodles</span>&#xa0;<span class="Pork">Pork</span></span></a></li>
<li><a href="#org29f448b">1.2. Calzone&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Italian">Italian</span>&#xa0;<span class="Pizza">Pizza</span></span></a></li>
<li><a href="#orgb6a2ccb">1.3. Poblano con queso taco&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Mexican">Mexican</span>&#xa0;<span class="Cheese">Cheese</span>&#xa0;<span class="Taco">Taco</span></span></a></li>
<li><a href="#org8c4f3e1">1.4. Crispy Baked wings&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Chicken">Chicken</span>&#xa0;<span class="Wings">Wings</span></span></a></li>
<li><a href="#org1c1eabd">1.5. PK Chicken Karahi&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Chicken">Chicken</span></span></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org05d341d" class="outline-2">
<h2 id="org05d341d"><span class="section-number-2">1.</span> Ideas</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org16551e3" class="outline-3">
<h3 id="org16551e3"><span class="section-number-3">1.1.</span> zha jiang min&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Chinese">Chinese</span>&#xa0;<span class="Noodles">Noodles</span>&#xa0;<span class="Pork">Pork</span></span></h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://youtu.be/NM4ArR-qbHQ">Link</a> <br />
1-Hour Noodles <br />
Servings: 2 <br />
Ingredients <br />
</p>
<ul class="org-ul">
<li>2 tablespoons plus 1 teaspoon vegetable oil, divided <br /></li>
<li>1 tablespoon plus 1 teaspoon minced garlic, divided <br /></li>
<li>1 tablespoon minced fresh ginger <br /></li>
<li>1 tablespoon minced shallot <br /></li>
<li>4 ounces 80/20 ground pork <br /></li>
<li>1 tablespoon fermented soy bean paste <br /></li>
<li>1 tablespoon sweet bean sauce <br /></li>
<li>1 teaspoon dark soy sauce <br /></li>
<li>¼ cup cornstarch slurry (8 teaspoons cornstarch mixed with 4 teaspoons water) <br /></li>
<li>1 large egg, beaten <br /></li>
<li>360 grams fresh noodle of choice <br /></li>
<li>1 Persian cucumber, thinly sliced <br /></li>
<li>½ cup fresh cilantro leaves <br /></li>
</ul>
<p>
 <br />
Preparation <br />
</p>
<ol class="org-ol">
<li>In  a medium pan, heat 1 tablespoon of vegetable oil over medium heat. Add 1  tablespoon of minced garlic, the ginger, and shallot and sauté until  lightly aromatic, 1-2 minutes. Add the ground pork to the pan and cook,  undisturbed, until golden brown, 3-5 minutes.  <br /></li>
<li>Meanwhile,  in a small pan, heat another tablespoon of vegetable oil over  medium-low heat. Add the soy bean paste and sweet bean sauce and cook  until caramelized, 1-2 minutes, being careful not to burn. <br /></li>
<li>Add  the caramelized bean paste mixture to the ground pork mixture and stir  to combine. Add the soy sauce and cook for another 30 seconds to  incorporate. Add the cornstarch slurry, reduce the heat to low, and  simmer for about 15 minutes, adding a few tablespoons of water at a time  as needed to keep the mixture at a simmer. <br /></li>
<li>Meanwhile,  heat a small pan over low heat. Add the remaining  teaspoon of  vegetable oil, then pour in the egg and tilt the pan to spread in a thin  layer. Cook until the top is just set, then remove the egg crepe from  the pan. Let cool, then thinly slice. <br /></li>
<li>Cook the noodles according to the package instructions, then drain.  <br /></li>
<li>Place  the cooked noodles in a serving bowl and top with the ground pork  mixture. Garnish with the egg crepe strips, cucumber, cilantro, and  remaining teaspoon of minced garlic. <br /></li>
</ol>
<p>
Enjoy! <br />
</p>
</div>
</div>
<div id="outline-container-org29f448b" class="outline-3">
<h3 id="org29f448b"><span class="section-number-3">1.2.</span> Calzone&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Italian">Italian</span>&#xa0;<span class="Pizza">Pizza</span></span></h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="https://www.youtube.com/watch?v=PrbpuNZyoUQ">link</a><br />
</p>
</div>
</div>
<div id="outline-container-orgb6a2ccb" class="outline-3">
<h3 id="orgb6a2ccb"><span class="section-number-3">1.3.</span> Poblano con queso taco&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Mexican">Mexican</span>&#xa0;<span class="Cheese">Cheese</span>&#xa0;<span class="Taco">Taco</span></span></h3>
<div class="outline-text-3" id="text-1-3">
<p>
This <a href="https://youtu.be/YtkyC2Ctz6E">recipe</a> looked interesting.<br />
</p>
</div>
</div>
<div id="outline-container-org8c4f3e1" class="outline-3">
<h3 id="org8c4f3e1"><span class="section-number-3">1.4.</span> Crispy Baked wings&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Chicken">Chicken</span>&#xa0;<span class="Wings">Wings</span></span></h3>
<div class="outline-text-3" id="text-1-4">
<p>
This just looks <a href="https://www.youtube.com/watch?v=mh2AXh1eRmE">good</a>.<br />
</p>
</div>
</div>
<div id="outline-container-org1c1eabd" class="outline-3">
<h3 id="org1c1eabd"><span class="section-number-3">1.5.</span> PK Chicken Karahi&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Chicken">Chicken</span></span></h3>
<div class="outline-text-3" id="text-1-5">
<p>
<a href="https://www.youtube.com/watch?v=4PMmH2-5wJM">link</a><br />
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tobin Stultiens</p>
<p class="date">Created: 2022-01-24 ma 22:12</p>
</div>
</body>
</html>
